joergs-git/cloudwatcher-waveshare/sdkconfig.defaults
# CloudWatcher Waveshare Display - SDK Configuration Defaults
# Target: ESP32-P4

CONFIG_IDF_TARGET="esp32p4"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Enable experimental features (required for 200MHz PSRAM on ESP32-P4)
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# PSRAM - ESP32-P4 has PSRAM support needed for frame buffers
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# Allocate frame buffers from PSRAM
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Display: use 2 frame buffers with avoid-tear to prevent DPI underrun
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=2
CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR=y
CONFIG_BSP_DISPLAY_LVGL_FULL_REFRESH=y

# WiFi - ESP32-P4 uses ESP32-C6 co-processor via esp_hosted/esp_wifi_remote
CONFIG_ESP_WIFI_REMOTE_ENABLED=y

# LWIP
CONFIG_LWIP_MAX_SOCKETS=8

# HTTP Client
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

# TLS certificate bundle for HTTPS (Pushover + Meteoblue)
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# Task Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# Compiler optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Flash size (32MB on this board)
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="32MB"

# LVGL fonts - enable sizes needed by our UI
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_40=y
